import os
import re

from dotenv import load_dotenv

dotenv_path = os.path.join(os.path.dirname(__file__), '..', '.env')
load_dotenv(dotenv_path=dotenv_path)

GIGACHAT_TOKEN = os.getenv("GIGACHAT_TOKEN")
SPEAKER_WAV = "voice_banks/камелия.wav"
BLOCKED_PHRASES = [
    "динамичная музыка", "смех", "включи музыку", "сыграй песню",
    "ах ах ах", "ух ух ух", "спокойная музыка", "редактор субтитров"
]
ALLOWED_PHRASES = ["герт", "хонкай", "honkai"]

OBSCENE_PATTERNS = [re.compile(r'\b((?:(?:(?:у|[нз]а|(?:хитро|не)?вз?[ыьъ]|с[ьъ]|'
                               r'(?:и|ра)[зс]ъ?|(?:о[тб]|п[оа]д)[ьъ]?|(?:\S(?=[а-яё]))+?'
                               r'[оаеи-])-?)?(?:[её](?:б(?!о[рй]|рач)|п[уа](?:ц|тс))|и[п'
                               r'б][ае][тцд][ьъ]).*?|(?:(?:н[иеа]|(?:ра|и)[зс]|[зд]?[ао]'
                               r'(?:т|дн[оа])?|с(?:м[еи])?|а[пб]ч|в[ъы]?|пр[еи])-?)?ху(?'
                               r':[яйиеёю]|л+и(?!ган)).*?|бл(?:[эя]|еа?)(?:[дт][ьъ]?)?|'
                               r'\S*?(?:п(?:[иеё]зд|ид[аое]?р|ед(?:р(?!о)|[аое]р|ик)|оху'
                               r'ю)|бля(?:[дбц]|тс)|[ое]ху[яйиеё]|хуйн).*?|(?:о[тб]?|про'
                               r'|на|вы)?м(?:анд(?:[ауеыи](?:л(?:и[сзщ])?[ауеиы])?|ой|[а'
                               r'о]в.*?|юк(?:ов|[ауи])?|е[нт]ь|ища)|уд(?:[яаиое].+?|е?н('
                               r'?:[ьюия]|ей))|[ао]л[ао]ф[ьъ](?:[яиюе]|[еёо]й))|елд[ауые'
                               r'].*?|ля[тд]ь|(?:[нз]а|по)х))\b', re.IGNORECASE)]

OBSCENE_REPLACEMENTS = {
    r"\bблядь\b": "блин",
    r"\bсука\b": "милашка",
    r"\bхуй\b": "мяу",
    r"\bпиздец\b": "капец",
    r"\bебать\b": "фигачить",
    r"\bебан(ый|ая|ое|ые|уть)\b": "лучший в мире",
    r"\bоху(е[нлн][а-я]*)\b": "офигенно",
    r"\bёб твою мать\b": "твою ж дивизию"
}

CHARACTER_AI_TOKEN = os.getenv("CHARACTER_AI_TOKEN")
CHARACTER_ID = os.getenv("CHARACTER_ID")
